{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"padding": "same", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "conv2d_1", "dtype": "float32", "use_bias": true, "filters": 6, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_size": [5, 5], "activation": "tanh", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_1", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_2", "use_bias": true, "filters": 16, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [5, 5], "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_2", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"padding": "valid", "data_format": "channels_last", "kernel_regularizer": null, "strides": [1, 1], "bias_constraint": null, "name": "conv2d_3", "use_bias": true, "filters": 120, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [5, 5], "activation": "tanh", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "units": 84, "trainable": true, "activation": "tanh", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "units": 10, "trainable": true, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}